app/views/messages/index.html.erb

                  <div id="from">
                    From: <%= User.find(message.from).name %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1