app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "users"
---
<h3>Welcome</h3>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>