app/views/dogs/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	<h3><%= @dog.name if @dog.name %></h3>
<p>Owner: <%= User.find(@dog.user_id).name %> </p>