app/views/users/show.html.erb

SELECT "dogs".* FROM "dogs"  WHERE "dogs"."user_id" = ?  [["user_id", 1]]
---
	<h3> My Dogs:</h3>
	<div class="dog-box"><% @user.dogs.each do |dog| %>