app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("age", "breed", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["age", 2], ["breed", "What"], ["created_at", "2014-12-01 04:09:56.244469"], ["name", "Ros"], ["updated_at", "2014-12-01 04:09:56.244469"], ["user_id", 2]]
UPDATE "users" SET "updated_at" = ?, "which" = ? WHERE "users"."id" = 4  [["updated_at", "2014-12-04 05:17:11.588027"], ["which", 1]]
---
	def create
		@dog = Dog.new(dog_params)
		@dog.user_id = current_user.id
		if @dog.save
			current_user.which = 1
			@current_user.save

SELECT  "dogs".* FROM "dogs"  WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@dog = Dog.find(params[:id])