app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.to = message_params[:to]
    @message.date = message_params[:date]
    @message.from = current_user.id
    @message.save
---
INSERT INTO "messages" ("created_at", "from", "message", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-21 02:38:05.931944"], ["from", 1], ["message", "Hi!"], ["updated_at", "2014-11-21 02:38:05.931944"]]